tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "neovim/neovim"
tap "oclint/formulae"
tap "osx-cross/avr"
tap "px4/px4"
tap "robotsandpencils/made"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
brew "arduino-cli"
brew "open-mpi"
brew "python"
brew "asciinema"
brew "autoconf"
brew "libelf"
brew "libusb"
brew "libftdi0"
brew "libhid"
brew "avrdude"
brew "bash"
brew "bat"
brew "libpng"
brew "llvm"
brew "ccls"
brew "cloc"
brew "cowsay"
brew "ctags", link: false
brew "datamash"
brew "dfu-programmer"
brew "docker"
brew "docker-machine"
brew "ghostscript"
brew "ffmpeg"
brew "fish"
brew "fortune"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-flow-avh"
brew "go"
brew "libtool"
brew "imagemagick", link: false
brew "imagemagick@6", link: true
brew "less"
brew "neovim"
brew "nvm"
brew "open-ocd"
brew "pandoc"
brew "parallel"
brew "pstoedit"
brew "r"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "scipy"
brew "sl"
brew "swiftlint", args: ["HEAD"]
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tmate"
brew "tmux"
brew "tree"
brew "wget"
brew "xctool"
brew "yarn", link: false
brew "oclint/formulae/oclint"
brew "osx-cross/avr/avr-gcc"
brew "px4/px4/gcc-arm-none-eabi"
brew "robotsandpencils/made/xcodes"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "amethyst"
cask "cakebrew"
cask "mactex"
